zzzz1121/A-dream/src/m5stack_core_esp32_test/main.cpp
#include <Arduino.h>
#include <M5Stack.h>
#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <esp_arduino_version.h>

#define BOARD_NAME "M5Stack Core ESP32"
#define DEVICE_ROLE "m5GatewayMonitor"
#define ESPNOW_CHANNEL 1
#define SERIAL_BAUD 115200
#define SERIAL_LINE_BUFFER_SIZE 192
#define DISPLAY_REFRESH_MS 1000
#define STATUS_PRINT_MS 1000
#define SERIAL_TIMEOUT_MS 3000
#define MIC_STATUS_TIMEOUT_MS 3000
#define CONTROL_SEND_REPEATS 5
#define CONTROL_SEND_REPEAT_DELAY_MS 20
#define DREAM_PACKET_MAGIC 0x44524541UL
#define DREAM_PROTOCOL_VERSION 1

const uint8_t BROADCAST_MAC[] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

enum DreamPacketType : uint8_t {
  DREAM_PACKET_EEG = 1,
  DREAM_PACKET_MIC_STATUS = 2,
  DREAM_PACKET_CONTROL = 3,
};

enum DreamPacketFlags : uint8_t {
  EEG_FLAG_SIGNAL_OK = 1 << 0,
  EEG_FLAG_SOURCE_TIMEOUT = 1 << 1,
  EEG_FLAG_CHECKSUM_OK = 1 << 2,
};

enum DreamLightMode : uint8_t {
  LIGHT_OFF,
  LIGHT_IDLE,
  LIGHT_EEG_BLEND,
  LIGHT_SIGNAL_BAD,
  LIGHT_TIMEOUT,
  LIGHT_MANUAL,
};

enum DreamStepperState : uint8_t {
  STEPPER_DISABLED,
  STEPPER_IDLE,
  STEPPER_MOVING,
  STEPPER_BREATHING,
  STEPPER_LIMITED,
  STEPPER_FAULT,
};

enum DreamRelayState : uint8_t {
  RELAY_OFF,
  RELAY_ARMING,
  RELAY_ON,
  RELAY_COOLDOWN,
  RELAY_FAULT,
};

enum DreamSafetyState : uint8_t {
  SAFETY_NORMAL,
  SAFETY_SIGNAL_BAD,
  SAFETY_LINK_TIMEOUT,
  SAFETY_ESTOP,
  SAFETY_FAULT,
};

enum DreamControlAction : uint8_t {
  CONTROL_NONE,
  CONTROL_SYSTEM_ENABLE,
  CONTROL_SYSTEM_DISABLE,
  CONTROL_LIGHT_AUTO,
  CONTROL_LIGHT_COLOR,
  CONTROL_LIGHT_OFF,
  CONTROL_RELAY_ON,
  CONTROL_RELAY_OFF,
  CONTROL_STEPPER_FORWARD,
  CONTROL_STEPPER_BACKWARD,
  CONTROL_STEPPER_STOP,
  CONTROL_ALL_STOP,
};

struct __attribute__((packed)) DreamEegEspNowPacket {
  uint32_t magic;
  uint16_t version;
  uint8_t type;
  uint8_t flags;
  uint32_t seq;
  uint32_t pcTimeMs;
  uint32_t m5UptimeMs;
  uint8_t poorSignal;
  uint8_t attention;
  uint8_t meditation;
  uint8_t reserved;
  uint32_t eegPower[8];
  uint16_t checksum;
};

struct __attribute__((packed)) DreamMicStatusPacket {
  uint32_t magic;
  uint16_t version;
  uint8_t type;
  uint8_t flags;
  uint32_t seq;
  uint32_t uptimeMs;
  uint32_t lastEegSeq;
  uint32_t eegAgeMs;
  uint32_t rxCount;
  uint32_t dropCount;
  uint32_t timeoutCount;
  uint8_t poorSignal;
  uint8_t attention;
  uint8_t meditation;
  uint8_t lightLevel;
  uint8_t lightMode;
  uint8_t light1R;
  uint8_t light1G;
  uint8_t light1B;
  uint8_t light1W;
  uint8_t light2R;
  uint8_t light2G;
  uint8_t light2B;
  uint8_t light2W;
  uint8_t stepperState;
  uint8_t relayState;
  uint8_t safetyState;
  uint32_t controlRxCount;
  uint8_t lastControlAction;
  uint8_t manualLightEnabled;
  uint8_t relayOutputEnabled;
  uint8_t stepperOutputEnabled;
  uint8_t systemEnabled;
  uint16_t checksum;
};

struct __attribute__((packed)) DreamControlEspNowPacket {
  uint32_t magic;
  uint16_t version;
  uint8_t type;
  uint8_t flags;
  uint32_t seq;
  uint32_t pcTimeMs;
  uint32_t m5UptimeMs;
  uint8_t action;
  uint8_t reserved;
  uint16_t arg1;
  uint16_t arg2;
  uint16_t arg3;
  uint16_t arg4;
  uint16_t checksum;
};

DreamEegEspNowPacket latestEegPacket = {};
DreamMicStatusPacket latestMicStatus = {};

char serialLine[SERIAL_LINE_BUFFER_SIZE] = {};
uint8_t serialLineIndex = 0;
uint32_t serialFrameCount = 0;
uint32_t serialErrorCount = 0;
uint32_t espNowSendCount = 0;
uint32_t espNowSendFailCount = 0;
uint32_t controlRxCount = 0;
uint32_t controlSendCount = 0;
uint32_t controlSendFailCount = 0;
uint32_t localControlSeq = 0;
uint32_t espNowLastSendMs = 0;
uint32_t lastSerialFrameMs = 0;
uint32_t lastMicStatusMs = 0;
uint32_t lastDisplayRefreshMs = 0;
uint32_t lastStatusPrintMs = 0;
bool espNowReady = false;
bool haveEeg = false;
bool haveMicStatus = false;
esp_now_send_status_t lastSendStatus = ESP_NOW_SEND_FAIL;

uint16_t packetChecksum(const uint8_t *data, size_t length) {
  uint32_t sum = 0;
  for (size_t i = 0; i < length; i++) {
    sum += data[i];
  }
  return static_cast<uint16_t>(sum & 0xFFFF);
}

template <typename Packet>
uint16_t calculatePacketChecksum(const Packet &packet) {
  return packetChecksum(reinterpret_cast<const uint8_t *>(&packet), sizeof(Packet) - sizeof(packet.checksum));
}

const char *lightModeName(uint8_t value) {
  switch (value) {
    case LIGHT_OFF: return "OFF";
    case LIGHT_IDLE: return "IDLE";
    case LIGHT_EEG_BLEND: return "EEG";
    case LIGHT_SIGNAL_BAD: return "BAD";
    case LIGHT_TIMEOUT: return "TIMEOUT";
    case LIGHT_MANUAL: return "MANUAL";
    default: return "?";
  }
}

const char *stepperStateName(uint8_t value) {
  switch (value) {
    case STEPPER_DISABLED: return "DISABLED";
    case STEPPER_IDLE: return "IDLE";
    case STEPPER_MOVING: return "MOVING";
    case STEPPER_BREATHING: return "BREATH";
    case STEPPER_LIMITED: return "LIMIT";
    case STEPPER_FAULT: return "FAULT";
    default: return "?";
  }
}

const char *relayStateName(uint8_t value) {
  switch (value) {
    case RELAY_OFF: return "OFF";
    case RELAY_ARMING: return "ARMING";
    case RELAY_ON: return "ON";
    case RELAY_COOLDOWN: return "COOL";
    case RELAY_FAULT: return "FAULT";
    default: return "?";
  }
}

const char *safetyStateName(uint8_t value) {
  switch (value) {
    case SAFETY_NORMAL: return "NORMAL";
    case SAFETY_SIGNAL_BAD: return "SIGNAL";
    case SAFETY_LINK_TIMEOUT: return "TIMEOUT";
    case SAFETY_ESTOP: return "ESTOP";
    case SAFETY_FAULT: return "FAULT";
    default: return "?";
  }
}

uint16_t ageColor(uint32_t ageMs, uint32_t warnMs, uint32_t badMs) {
  if (ageMs < warnMs) {
    return 0x07E0;
  }
  if (ageMs < badMs) {
    return 0xFFE0;
  }
  return 0xF800;
}

uint16_t signalColor(uint8_t poorSignal) {
  if (poorSignal <= 50) {
    return 0x07E0;
  }
  if (poorSignal <= 120) {
    return 0xFFE0;
  }
  return 0xF800;
}

void printMacAddress(const uint8_t *mac) {
  for (uint8_t i = 0; i < 6; i++) {
    if (mac[i] < 0x10) {
      Serial.print("0");
    }
    Serial.print(mac[i], HEX);
    if (i < 5) {
      Serial.print(":");
    }
  }
}

bool readCsvNumber(char *&cursor, uint32_t &value) {
  while (*cursor == ' ' || *cursor == '\t' || *cursor == ',') {
    cursor++;
  }

  if (*cursor < '0' || *cursor > '9') {
    return false;
  }

