zzzz1121/A-dream/src/m5stack_core_esp32_test/main.cpp
  char *endPtr = cursor;
  value = strtoul(cursor, &endPtr, 10);
  cursor = endPtr;
  return true;
}

bool readCsvToken(char *&cursor, char *token, size_t tokenSize) {
  while (*cursor == ' ' || *cursor == '\t' || *cursor == ',') {
    cursor++;
  }

  if (*cursor == '\0' || tokenSize == 0) {
    return false;
  }

  size_t index = 0;
  while (*cursor != '\0' && *cursor != ',') {
    if (index + 1 < tokenSize) {
      token[index++] = *cursor;
    }
    cursor++;
  }
  token[index] = '\0';
  return index > 0;
}

uint8_t controlActionFromName(const char *actionName) {
  if (strcmp(actionName, "SYSTEM_ENABLE") == 0) {
    return CONTROL_SYSTEM_ENABLE;
  }
  if (strcmp(actionName, "SYSTEM_DISABLE") == 0) {
    return CONTROL_SYSTEM_DISABLE;
  }
  if (strcmp(actionName, "LIGHT_AUTO") == 0) {
    return CONTROL_LIGHT_AUTO;
  }
  if (strcmp(actionName, "LIGHT_COLOR") == 0) {
    return CONTROL_LIGHT_COLOR;
  }
  if (strcmp(actionName, "LIGHT_OFF") == 0) {
    return CONTROL_LIGHT_OFF;
  }
  if (strcmp(actionName, "RELAY_ON") == 0) {
    return CONTROL_RELAY_ON;
  }
  if (strcmp(actionName, "RELAY_OFF") == 0) {
    return CONTROL_RELAY_OFF;
  }
  if (strcmp(actionName, "STEPPER_FORWARD") == 0) {
    return CONTROL_STEPPER_FORWARD;
  }
  if (strcmp(actionName, "STEPPER_BACKWARD") == 0) {
    return CONTROL_STEPPER_BACKWARD;
  }
  if (strcmp(actionName, "STEPPER_STOP") == 0) {
    return CONTROL_STEPPER_STOP;
  }
  if (strcmp(actionName, "ALL_STOP") == 0) {
    return CONTROL_ALL_STOP;
  }
  return CONTROL_NONE;
}

bool parseEegLine(char *line, DreamEegEspNowPacket &packet) {
  if (strncmp(line, "EEG,", 4) != 0) {
    return false;
  }

  char *cursor = line + 4;
  uint32_t values[13] = {};
  for (uint8_t i = 0; i < 13; i++) {
    if (!readCsvNumber(cursor, values[i])) {
      return false;
    }
  }

  memset(&packet, 0, sizeof(packet));
  packet.magic = DREAM_PACKET_MAGIC;
  packet.version = DREAM_PROTOCOL_VERSION;
  packet.type = DREAM_PACKET_EEG;
  packet.seq = values[0];
  packet.pcTimeMs = values[1];
  packet.m5UptimeMs = millis();
  packet.poorSignal = static_cast<uint8_t>(constrain(static_cast<int>(values[2]), 0, 255));
  packet.attention = static_cast<uint8_t>(constrain(static_cast<int>(values[3]), 0, 100));
  packet.meditation = static_cast<uint8_t>(constrain(static_cast<int>(values[4]), 0, 100));
  packet.flags = EEG_FLAG_CHECKSUM_OK;
  if (packet.poorSignal <= 120) {
    packet.flags |= EEG_FLAG_SIGNAL_OK;
  }

  for (uint8_t i = 0; i < 8; i++) {
    packet.eegPower[i] = values[5 + i];
  }

  packet.checksum = calculatePacketChecksum(packet);
  return true;
}

bool parseControlLine(char *line, DreamControlEspNowPacket &packet) {
  if (strncmp(line, "CMD,", 4) != 0) {
    return false;
  }

  char *cursor = line + 4;
  uint32_t seq = 0;
  uint32_t pcTimeMs = 0;
  char actionName[28] = {};
  uint32_t args[4] = {};

  if (!readCsvNumber(cursor, seq) ||
      !readCsvNumber(cursor, pcTimeMs) ||
      !readCsvToken(cursor, actionName, sizeof(actionName))) {
    return false;
  }

  const uint8_t action = controlActionFromName(actionName);
  if (action == CONTROL_NONE) {
    return false;
  }

  for (uint8_t i = 0; i < 4; i++) {
    if (!readCsvNumber(cursor, args[i])) {
      args[i] = 0;
    }
  }

  memset(&packet, 0, sizeof(packet));
  packet.magic = DREAM_PACKET_MAGIC;
  packet.version = DREAM_PROTOCOL_VERSION;
  packet.type = DREAM_PACKET_CONTROL;
  packet.seq = seq;
  packet.pcTimeMs = pcTimeMs;
  packet.m5UptimeMs = millis();
  packet.action = action;
  packet.arg1 = static_cast<uint16_t>(constrain(static_cast<int>(args[0]), 0, 65535));
  packet.arg2 = static_cast<uint16_t>(constrain(static_cast<int>(args[1]), 0, 65535));
  packet.arg3 = static_cast<uint16_t>(constrain(static_cast<int>(args[2]), 0, 65535));
  packet.arg4 = static_cast<uint16_t>(constrain(static_cast<int>(args[3]), 0, 65535));
  packet.checksum = calculatePacketChecksum(packet);
  return true;
}

void sendEegToMicroduino() {
  if (!espNowReady || !haveEeg) {
    return;
  }

  latestEegPacket.m5UptimeMs = millis();
  latestEegPacket.checksum = 0;
  latestEegPacket.checksum = calculatePacketChecksum(latestEegPacket);

  const esp_err_t result = esp_now_send(BROADCAST_MAC,
                                        reinterpret_cast<const uint8_t *>(&latestEegPacket),
                                        sizeof(latestEegPacket));
  if (result == ESP_OK) {
    espNowSendCount++;
    espNowLastSendMs = millis();
  } else {
    espNowSendFailCount++;
  }
}

void sendControlToMicroduino(DreamControlEspNowPacket &packet) {
  if (!espNowReady) {
    controlSendFailCount++;
    return;
  }

  bool sent = false;
  esp_err_t lastResult = ESP_OK;
  for (uint8_t attempt = 0; attempt < CONTROL_SEND_REPEATS; attempt++) {
    packet.m5UptimeMs = millis();
    packet.checksum = 0;
    packet.checksum = calculatePacketChecksum(packet);

    lastResult = esp_now_send(BROADCAST_MAC,
                              reinterpret_cast<const uint8_t *>(&packet),
                              sizeof(packet));
    if (lastResult == ESP_OK) {
      sent = true;
      espNowSendCount++;
      espNowLastSendMs = millis();
    } else {
      espNowSendFailCount++;
    }

    if (attempt + 1 < CONTROL_SEND_REPEATS) {
      delay(CONTROL_SEND_REPEAT_DELAY_MS);
    }
  }

  if (sent) {
    controlSendCount++;
    Serial.print("EVENT=CONTROL_TX SEQ=");
    Serial.print(packet.seq);
    Serial.print(" ACTION=");
    Serial.print(packet.action);
    Serial.print(" REPEATS=");
    Serial.println(CONTROL_SEND_REPEATS);
  } else {
    controlSendFailCount++;
    Serial.print("EVENT=CONTROL_TX_FAIL SEQ=");
    Serial.print(packet.seq);
    Serial.print(" ERR=");
    Serial.println(lastResult);
  }
}

void sendLocalControl(uint8_t action, uint16_t arg1 = 0, uint16_t arg2 = 0, uint16_t arg3 = 0, uint16_t arg4 = 0) {
  DreamControlEspNowPacket packet = {};
  packet.magic = DREAM_PACKET_MAGIC;
  packet.version = DREAM_PROTOCOL_VERSION;
  packet.type = DREAM_PACKET_CONTROL;
  packet.seq = localControlSeq++;
  packet.pcTimeMs = millis();
  packet.m5UptimeMs = millis();
  packet.action = action;
  packet.arg1 = arg1;
  packet.arg2 = arg2;
  packet.arg3 = arg3;
  packet.arg4 = arg4;
  packet.checksum = calculatePacketChecksum(packet);
  controlRxCount++;
  sendControlToMicroduino(packet);
}

void handleButtons() {
  if (M5.BtnA.wasPressed()) {
    sendLocalControl(CONTROL_SYSTEM_ENABLE);
    Serial.println("EVENT=LOCAL_CONTROL ACTION=SYSTEM_ENABLE SOURCE=BTN_A");
  }
  if (M5.BtnC.wasPressed()) {
    sendLocalControl(CONTROL_SYSTEM_DISABLE);
    Serial.println("EVENT=LOCAL_CONTROL ACTION=SYSTEM_DISABLE SOURCE=BTN_C");
  }
  if (M5.BtnB.wasPressed()) {
    sendLocalControl(CONTROL_ALL_STOP);
    Serial.println("EVENT=LOCAL_CONTROL ACTION=ALL_STOP SOURCE=BTN_B");
  }
}

