zzzz1121/A-dream/src/m5stack_core_esp32_test/main.cpp
void processSerialLine() {
  serialLine[serialLineIndex] = '\0';
  if (serialLineIndex == 0) {
    return;
  }

  DreamEegEspNowPacket packet = {};
  if (parseEegLine(serialLine, packet)) {
    latestEegPacket = packet;
    serialFrameCount++;
    lastSerialFrameMs = millis();
    haveEeg = true;

    Serial.print("EVENT=SERIAL_EEG_RX SEQ=");
    Serial.print(latestEegPacket.seq);
    Serial.print(" ATTENTION=");
    Serial.print(latestEegPacket.attention);
    Serial.print(" MEDITATION=");
    Serial.print(latestEegPacket.meditation);
    Serial.print(" POOR_SIGNAL=");
    Serial.println(latestEegPacket.poorSignal);

    sendEegToMicroduino();
    return;
  }

  DreamControlEspNowPacket controlPacket = {};
  if (parseControlLine(serialLine, controlPacket)) {
    controlRxCount++;
    Serial.print("EVENT=SERIAL_CMD_RX SEQ=");
    Serial.print(controlPacket.seq);
    Serial.print(" ACTION=");
    Serial.println(controlPacket.action);
    sendControlToMicroduino(controlPacket);
    return;
  }

  serialErrorCount++;
  Serial.print("EVENT=SERIAL_PARSE_FAIL TEXT=");
  Serial.println(serialLine);
}

void handleSerialInput() {
  while (Serial.available() > 0) {
    const char value = static_cast<char>(Serial.read());
    if (value == '\r') {
      continue;
    }

    if (value == '\n') {
      processSerialLine();
      serialLineIndex = 0;
      continue;
    }

    if (value < 0x20 || value > 0x7E) {
      continue;
    }

    if (serialLineIndex < SERIAL_LINE_BUFFER_SIZE - 1) {
      serialLine[serialLineIndex++] = value;
    } else {
      serialLineIndex = 0;
      serialErrorCount++;
      Serial.println("EVENT=SERIAL_LINE_TOO_LONG");
    }
  }
}

void onEspNowSent(const uint8_t *macAddress, esp_now_send_status_t status) {
  lastSendStatus = status;
  if (status != ESP_NOW_SEND_SUCCESS) {
    espNowSendFailCount++;
  }
}

void handleEspNowReceive(const uint8_t *macAddress, const uint8_t *data, int dataLength) {
  if (dataLength != static_cast<int>(sizeof(DreamMicStatusPacket))) {
    return;
  }

  DreamMicStatusPacket packet = {};
  memcpy(&packet, data, sizeof(packet));
  if (packet.magic != DREAM_PACKET_MAGIC ||
      packet.version != DREAM_PROTOCOL_VERSION ||
      packet.type != DREAM_PACKET_MIC_STATUS) {
    return;
  }

  const uint16_t expectedChecksum = calculatePacketChecksum(packet);
  if (packet.checksum != expectedChecksum) {
    return;
  }

  latestMicStatus = packet;
  haveMicStatus = true;
  lastMicStatusMs = millis();
}

#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void onEspNowReceive(const esp_now_recv_info_t *recvInfo, const uint8_t *data, int dataLength) {
  const uint8_t *macAddress = recvInfo == nullptr ? nullptr : recvInfo->src_addr;
  handleEspNowReceive(macAddress, data, dataLength);
}
#else
void onEspNowReceive(const uint8_t *macAddress, const uint8_t *data, int dataLength) {
  handleEspNowReceive(macAddress, data, dataLength);
}
#endif

void initEspNow() {
  WiFi.mode(WIFI_STA);
  WiFi.disconnect();
  esp_wifi_set_ps(WIFI_PS_NONE);
  esp_wifi_set_channel(ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE);

  Serial.print("EVENT=WIFI_STA_READY MAC=");
  Serial.println(WiFi.macAddress());
  Serial.print("EVENT=ESPNOW_CHANNEL VALUE=");
  Serial.println(ESPNOW_CHANNEL);

  const esp_err_t initResult = esp_now_init();
  if (initResult != ESP_OK) {
    Serial.print("EVENT=ESPNOW_INIT_FAIL ERR=");
    Serial.println(initResult);
    espNowReady = false;
    return;
  }

  esp_now_register_send_cb(onEspNowSent);
  esp_now_register_recv_cb(onEspNowReceive);

  esp_now_peer_info_t peerInfo = {};
  memcpy(peerInfo.peer_addr, BROADCAST_MAC, sizeof(BROADCAST_MAC));
  peerInfo.channel = ESPNOW_CHANNEL;
  peerInfo.ifidx = WIFI_IF_STA;
  peerInfo.encrypt = false;

  const esp_err_t peerResult = esp_now_add_peer(&peerInfo);
  if (peerResult != ESP_OK && peerResult != ESP_ERR_ESPNOW_EXIST) {
    Serial.print("EVENT=ESPNOW_ADD_PEER_FAIL ERR=");
    Serial.println(peerResult);
    espNowReady = false;
    return;
  }

  espNowReady = true;
  Serial.println("EVENT=ESPNOW_READY MODE=BROADCAST");
}

void drawStaticScreen() {
  M5.Lcd.fillScreen(0x0000);
  M5.Lcd.fillRect(0, 0, 320, 28, 0x18E3);
  M5.Lcd.setTextSize(2);
  M5.Lcd.setTextColor(0xFFFF, 0x18E3);
  M5.Lcd.setCursor(8, 6);
  M5.Lcd.print("Dream M5 Gateway");
}

template <typename Canvas>
void drawDashboardContent(Canvas &canvas, int16_t yShift) {
  const uint32_t now = millis();
  const uint32_t serialAgeMs = haveEeg ? now - lastSerialFrameMs : 0xFFFFFFFFUL;
  const uint32_t micAgeMs = haveMicStatus ? now - lastMicStatusMs : 0xFFFFFFFFUL;
  const bool micStatusFresh = haveMicStatus && micAgeMs < MIC_STATUS_TIMEOUT_MS;
  const uint8_t displayedPoorSignal = haveEeg ? latestEegPacket.poorSignal : 255;
  const uint32_t alphaPower = latestEegPacket.eegPower[2] + latestEegPacket.eegPower[3];
  const uint32_t betaPower = latestEegPacket.eegPower[4] + latestEegPacket.eegPower[5];
  const uint32_t gammaPower = latestEegPacket.eegPower[6] + latestEegPacket.eegPower[7];

  canvas.setTextSize(1);

  canvas.fillRect(0, 34 + yShift, 320, 14, 0x0000);
  canvas.setTextColor(ageColor(serialAgeMs, 500, SERIAL_TIMEOUT_MS), 0x0000);
  canvas.setCursor(8, 36 + yShift);
  canvas.printf("USB:%s age:%lums frames:%lu err:%lu",
                haveEeg && serialAgeMs < SERIAL_TIMEOUT_MS ? "OK" : "WAIT",
                haveEeg ? static_cast<unsigned long>(serialAgeMs) : 0,
                static_cast<unsigned long>(serialFrameCount),
                static_cast<unsigned long>(serialErrorCount));

  canvas.fillRect(0, 50 + yShift, 320, 14, 0x0000);
  canvas.setTextColor(lastSendStatus == ESP_NOW_SEND_SUCCESS ? 0x07E0 : 0xFFE0, 0x0000);
  canvas.setCursor(8, 52 + yShift);
  canvas.printf("ESP:%s tx:%lu fail:%lu ch:%u",
                espNowReady ? (lastSendStatus == ESP_NOW_SEND_SUCCESS ? "OK" : "SEND") : "OFF",
                static_cast<unsigned long>(espNowSendCount),
                static_cast<unsigned long>(espNowSendFailCount),
                ESPNOW_CHANNEL);

  canvas.fillRect(0, 72 + yShift, 320, 24, 0x0000);
  canvas.setTextColor(signalColor(displayedPoorSignal), 0x0000);
  canvas.setTextSize(2);
  canvas.setCursor(8, 76 + yShift);
  canvas.printf("Signal:%3u", displayedPoorSignal);

  canvas.fillRect(0, 100 + yShift, 320, 24, 0x0000);
  canvas.setTextColor(0xFFFF, 0x0000);
  canvas.setCursor(8, 104 + yShift);
  canvas.printf("Att:%3u  Med:%3u",
                haveEeg ? latestEegPacket.attention : 0,
                haveEeg ? latestEegPacket.meditation : 0);

  canvas.setTextSize(1);
  canvas.fillRect(0, 134 + yShift, 320, 14, 0x0000);
  canvas.setCursor(8, 136 + yShift);
  canvas.printf("seq:%lu pc:%lums",
                static_cast<unsigned long>(latestEegPacket.seq),
                static_cast<unsigned long>(latestEegPacket.pcTimeMs));
  canvas.fillRect(0, 150 + yShift, 320, 14, 0x0000);
  canvas.setCursor(8, 152 + yShift);
  canvas.printf("delta:%lu theta:%lu alpha:%lu",
                static_cast<unsigned long>(latestEegPacket.eegPower[0]),
                static_cast<unsigned long>(latestEegPacket.eegPower[1]),
                static_cast<unsigned long>(alphaPower));
  canvas.fillRect(0, 166 + yShift, 320, 14, 0x0000);
  canvas.setCursor(8, 168 + yShift);
  canvas.printf("beta:%lu gamma:%lu",
                static_cast<unsigned long>(betaPower),
                static_cast<unsigned long>(gammaPower));

  canvas.fillRect(0, 188 + yShift, 320, 14, 0x0000);
  canvas.setTextColor(ageColor(micAgeMs, 1000, MIC_STATUS_TIMEOUT_MS), 0x0000);
  canvas.setCursor(8, 190 + yShift);
  canvas.printf("MIC:%s age:%lums rx:%lu drop:%lu",
                micStatusFresh ? "OK" : "WAIT",
                haveMicStatus ? static_cast<unsigned long>(micAgeMs) : 0,
                static_cast<unsigned long>(latestMicStatus.rxCount),
                static_cast<unsigned long>(latestMicStatus.dropCount));

